app/Filament/Student/Widgets/DashboardWidget.php

select exists(select * from `user_information` where `user_id` = '9dfbcc50-7251-4350-890d-eaa04853818b') as `exists`
select exists(select * from `user_education` where `user_id` = '9dfbcc50-7251-4350-890d-eaa04853818b' and `user_education`.`deleted_at` is null) as `exists`
---
    public function mount(): void
    {
        // Cek apakah user yang login memiliki data UserInformation
        $this->hasUserInfo = UserInformation::where('user_id', Auth::id())->exists();
        $this->hasUserEdu = UserEducation::where('user_id', Auth::id())->exists();