app/Livewire/Dashboard/Index.php

select sum(`points`) as aggregate from `points` where `user_id` = '9dfbcc50-7251-4350-890d-eaa04853818b'
select count(*) as aggregate from `user_badges` where `user_id` = '9dfbcc50-7251-4350-890d-eaa04853818b' and `is_claimed` = 1
---
    public function mount()
    {
        $this->user = Auth::id();
        $this->points = $this->formatPoints(
            Points::where('user_id', $this->user)
                ->sum('points')
        );
        $this->badgeCount = UserBadge::where('user_id', $this->user)
            ->where('is_claimed', true)
            ->count();

select * from `classroom_users` where `user_id` = '9dfbcc50-7251-4350-890d-eaa04853818b' and `classroom_users`.`deleted_at` is null
select * from `classrooms` where `classrooms`.`id` in ('01jhsjj0pnzxhtq4e9hqzqkvhw', '01jmj5qxf6757xh7ebxkrwn70g', '01jpytp10dw814qet36gnyk6km', '01jwa1n3j9e79t2zt34kgs6xfe', '01jwa1rp9d9qqrjpywzszf038e', '01jwpz56zz6xccb0brtnn5syz1', '01jwpz64c81p3g790tkwge733s', '01jwsjrvyngrycre3p87ncja4t') and `classrooms`.`deleted_at` is null
select * from `programs` where `programs`.`id` in (1, 2, 3) and `programs`.`deleted_at` is null
---
    public function getEnrolledClassroomsProperty()
    {
        return ClassroomUser::with(['classroom.program'])
            ->where('user_id', $this->user)
            ->get();