app/Filament/Student/Pages/Classroom.php

    protected function fetchCourses()
    {
        // Fetch the currently logged-in user
        $user = Auth::user();

        // Fetch classrooms related to the user
        $classrooms = $user->classrooms;

        // Fetch courses related to these classrooms
        $courses = collect(); // Using Laravel's collection to merge courses

        foreach ($classrooms as $classroom) {
            $courses = $courses->merge($classroom->courses);
        }

        // Compute the total and completed material counts for each course
        $coursesWithMaterialStatus = $courses->map(function ($course) use ($user) {
            $totalMaterialCount = $course->chapters->flatMap(function ($chapter) {
                return $chapter->materials;
            })->count();

            $completedMaterialCount = $course->chapters->flatMap(function ($chapter) use ($user) {
                return $chapter->materials->filter(function ($material) use ($user) {
                    return $user->materials->contains($material);
                });
            })->count();

            $course->total_material_count = $totalMaterialCount;
            $course->completed_material_count = $completedMaterialCount;
            $course->percentage_completed = $totalMaterialCount > 0 ? ($completedMaterialCount / $totalMaterialCount) * 100 : 0;

            return $course;
        });
---
select `classrooms`.*, `classroom_users`.`user_id` as `pivot_user_id`, `classroom_users`.`classroom_id` as `pivot_classroom_id`, `classroom_users`.`created_at` as `pivot_created_at`, `classroom_users`.`updated_at` as `pivot_updated_at` from `classrooms` inner join `classroom_users` on `classrooms`.`id` = `classroom_users`.`classroom_id` where `classroom_users`.`user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056' and `classrooms`.`deleted_at` is null
select `courses`.*, `classroom_course`.`classroom_id` as `pivot_classroom_id`, `classroom_course`.`course_id` as `pivot_course_id`, `classroom_course`.`is_active` as `pivot_is_active`, `classroom_course`.`created_at` as `pivot_created_at`, `classroom_course`.`updated_at` as `pivot_updated_at` from `courses` inner join `classroom_course` on `courses`.`id` = `classroom_course`.`course_id` where `classroom_course`.`classroom_id` = '01jwsjx4gnhjne1mz472bw3t9b' and `courses`.`deleted_at` is null
select * from `materials` where `materials`.`chapter_id` = '01jpy62q17ye656md8jkgh9bak' and `materials`.`chapter_id` is not null and `materials`.`deleted_at` is null
select * from `chapters` where `chapters`.`course_id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' and `chapters`.`course_id` is not null and `chapters`.`deleted_at` is null