app/Filament/Student/Pages/SkillBadgePage.php

select sum(`points`) as aggregate from `points` where `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056'
---
    public function getUserPoints()
    {
        return Point::where('user_id', Auth::id())->sum('points');

select * from `badges` where (`type` = 'default' or (exists (select * from `user_badges` where `badges`.`id` = `user_badges`.`badge_id` and `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056' and `is_claimed` = 1))) and `badges`.`deleted_at` is null
select `users`.*, `user_badges`.`badge_id` as `pivot_badge_id`, `user_badges`.`user_id` as `pivot_user_id`, `user_badges`.`awarded_date` as `pivot_awarded_date`, `user_badges`.`created_at` as `pivot_created_at`, `user_badges`.`updated_at` as `pivot_updated_at` from `users` inner join `user_badges` on `users`.`id` = `user_badges`.`user_id` where `user_badges`.`badge_id` in (2, 3, 4, 5) and `users`.`deleted_at` is null
---
    public function getBadges()
    {
        $userPoints = $this->getUserPoints();
        $badges = Badge::with(['userBadges' => function ($query) {
            $query->where('user_id', Auth::id());
        }])
        ->where('type', 'default')
        ->orWhere(function($query) {
            $query->whereHas('userBadges', function($q) {
            $q->where('user_id', Auth::id())
              ->where('is_claimed', true);
            });
        })
        ->get();

        return $badges->map(function ($badge) use ($userPoints) {
            $userBadge = $badge->userBadges->first();
            return [
                'id' => $badge->id,
                'name' => $badge->name,
                'description' => $badge->description,
                'image' => $badge->image,
                'color' => $badge->color,
                'type' => $badge->type,
                'point_require' => $badge->point_require,
                'is_claimable' => $userPoints >= $badge->point_require,
                'is_claimed' => optional($userBadge)->is_claimed ?? false,
            ];
        });

select * from `courses` where `courses`.`id` in ('9e7d93db-744c-4dcd-8c30-e9f79d63e21a') and `courses`.`deleted_at` is null
select * from `points` where `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056' order by `created_at` desc limit 10
---
    public function getPointHistory()
    {
        return Point::where('user_id', Auth::id())
            ->with(['course'])
            ->orderBy('created_at', 'desc')
            ->limit(10)
            ->get();