routes/web.php

select * from `courses` where `course_publish` = 1 and `courses`.`deleted_at` is null order by RAND() limit 4
---

Route::get('/', function () {
    try {
		$courses = Course::where('course_publish', true)
				->inRandomOrder()
				->take(4)
				->get();