app/Livewire/Posts/ListPost.php

select * from `post_comments` where `post_comments`.`post_id` in (7, 8, 38) and `post_comments`.`deleted_at` is null
select * from `posts` where `course_id` = '9e7da199-29a5-4edf-825b-5b54f7bca185' and `posts`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in ('9f021762-9416-42cc-b143-8ece85bb82eb', '9f021765-5c7d-46b1-a3c9-2f7b446c760b', '9f24c5d8-2268-4eb8-b369-73bf59c5e25d') and `users`.`deleted_at` is null
select count(*) as aggregate from `posts` where `course_id` = '9e7da199-29a5-4edf-825b-5b54f7bca185' and `posts`.`deleted_at` is null
---
    public function render()
    {
        $posts = Post::where('course_id', $this->courseID)
            ->with(['user', 'comments.user'])
            ->latest()
            ->paginate($this->perPage);