app/Livewire/Reviews/CommentForm.php

select * from `course_reviews` where `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056' and `course_id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' and `course_reviews`.`deleted_at` is null limit 1
---
    public function checkIfUserHasReviewed(): void
    {
        // Cek apakah user sudah pernah memberikan review
        $existingReview = CourseReview::where('user_id', Auth::id())
            ->where('course_id', $this->courseID)
            ->first();