app/Livewire/Reviews/Comment.php

select * from `course_reviews` where `course_id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' and `course_reviews`.`deleted_at` is null order by `created_at` desc limit 10 offset 0
select * from `users` where `users`.`id` in ('9f0216af-71e4-4740-886b-9720a251e228', '9f021bed-8e15-4d38-a053-d6506169e18b', '9f021c1b-1f81-43e8-ba77-082c75038ab8', '9f129259-0496-457d-b596-a6c55d03036a', '9f129310-b78e-45c7-a0c1-ac2a520570ac', '9f14b39d-ec73-4a48-9c07-8c229bca1076', '9f24c5d8-2173-4077-a048-69ac70b8f586', '9f24c5d8-2268-4eb8-b369-73bf59c5e25d', '9f24c633-3252-4d73-a61f-1e14ac56c3c2', '9f2e2f72-1e45-4f21-bfe8-ee03a18e24b5') and `users`.`deleted_at` is null
select count(*) as aggregate from `course_reviews` where `course_id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' and `course_reviews`.`deleted_at` is null
---
    public function render()
    {
        // Lakukan query dan paginasi di sini
        $comments = CourseReview::where('course_id', $this->courseID)
            ->with('user') // Asumsi ada relasi user di model CourseReview
            ->latest() // Tampilkan data dari yang terbaru
            ->paginate($this->perPage);