app/Livewire/UserInformations/EditEducation.php

    public function form(Form $form): Form
    {
        return $form
            ->schema([
                Section::make()->schema([
                    Group::make()->schema([
                        Forms\Components\TextInput::make('student_id_number')
                            ->required()
                            ->numeric()
                            ->maxLength(255),
                    ])->columns(2),
                    Fieldset::make('Academic Class')->schema([
                        Forms\Components\Select::make('department_id')
                            ->required()
                            ->relationship('department', 'department_name')
                            ->reactive()
                            ->afterStateUpdated(fn (callable $set) => $set('program_id', null)),
                        Forms\Components\Select::make('program_id')
                            ->label('Program')
                            ->options(function (callable $get) {
                                $departmentId = $get('department_id');
                                if (! $departmentId) {
                                    return Program::all()->pluck('program_name', 'id');
                                }

                                return Program::where('department_id', $departmentId)->pluck('program_name', 'id');
---
select `program_name`, `id` from `programs` where `department_id` = '1' and `programs`.`deleted_at` is null

                            ->searchable()
                            ->preload()
                            ->options(function () {
                                return Semester::with('period')->get()->mapWithKeys(function ($semester) {
                                    return [$semester->id => $semester->period_and_semester_name];
                                });
---
select * from `periods` where `periods`.`id` in (1) and `periods`.`deleted_at` is null
select * from `semesters` where `semesters`.`deleted_at` is null