app/Livewire/Teacher/Dashboard.php

    public function mount()
    {
        $teacherId = Auth::id();
        $this->classroomCount = Classroom::whereHas('teachers', function ($query) use ($teacherId) {
            $query->where('users.id', $teacherId);
        })->count();
        $this->courseCount = Course::where('created_by', $teacherId)->count();
        $this->assignmentCount = Assignment::whereHas('chapter.course', function ($query) use ($teacherId) {
            $query->where('created_by', $teacherId);
        })->count();
        $this->studentCount = User::whereHas('classroomUsers', function ($query) use ($teacherId) {
            $query->whereIn('classroom_id', Classroom::whereHas('teachers', function ($query) use ($teacherId) {
                $query->where('users.id', $teacherId);
            })->pluck('id'));
        })->count();
---
select count(*) as aggregate from `courses` where `created_by` = '9e049512-eca8-4a74-a5d4-b66fca789fa4' and `courses`.`deleted_at` is null
select count(*) as aggregate from `assignments` where exists (select * from `chapters` where `assignments`.`chapter_id` = `chapters`.`id` and exists (select * from `courses` where `chapters`.`course_id` = `courses`.`id` and `created_by` = '9e049512-eca8-4a74-a5d4-b66fca789fa4' and `courses`.`deleted_at` is null) and `chapters`.`deleted_at` is null) and `assignments`.`deleted_at` is null
select count(*) as aggregate from `users` where exists (select * from `classroom_users` where `users`.`id` = `classroom_users`.`user_id` and `classroom_id` in ('01jwpz56zz6xccb0brtnn5syz1') and `classroom_users`.`deleted_at` is null) and `users`.`deleted_at` is null