app/Livewire/Projects/ListProject.php

                    ->createAnother(false)
                    ->visible(function ($record) {
                        // Cek apakah ProjectSubmission sudah ada untuk project ini oleh user yang sedang login
                        return ! ProjectSubmission::where('project_id', $record->id)
                            ->where('user_id', Auth::id())
                            ->exists();
---
select exists(select * from `project_submission` where `project_id` = '01jva48c4wad6jp7ppncb7mjt5' and `user_id` = '9dfbcc50-7251-4350-890d-eaa04853818b' and `project_submission`.`deleted_at` is null) as `exists`