app/Livewire/TakeQuiz.php

    public function mount(Quiz $quiz, $canAttemptToday, $todayLivesRemaining, $maxLivesPerDay)
    {
        $this->quiz = $quiz;
        $this->canAttemptToday = $canAttemptToday;
        $this->todayLivesRemaining = $todayLivesRemaining;
        $this->maxLivesPerDay = $maxLivesPerDay;

        $this->questions = $this->quiz->questions()->inRandomOrder()->limit(10)->get();
---
select * from `questions` where `questions`.`quiz_id` = 17 and `questions`.`quiz_id` is not null and `questions`.`deleted_at` is null order by RAND() limit 10

    public function nextQuestion()
    {
        if ($this->selectedAnswer === null) {
            Notification::make()->title('Peringatan!')->body('Anda harus memilih jawaban.')->warning()->send();
            return;
        }

        $currentQuestion = $this->questions[$this->currentQuestionIndex];
        $selectedAnswerObject = Answer::find($this->selectedAnswer);
---
select * from `answers` where `answers`.`id` = 160 and `answers`.`deleted_at` is null limit 1

    protected function completeQuiz()
    {
        $correctCount = collect($this->userAnswers)->where('is_correct', true)->count();
        $totalQuestions = $this->questions->count();
        $this->score = ($totalQuestions > 0) ? round(($correctCount / $totalQuestions) * 100) : 0;

        $isPerfectScore = ($this->score == 100);
        $status_complete = false; // Default: belum selesai

        if ($isPerfectScore) {
            $points_to_add = 20;

            // 1. BUAT RECORD BARU DI TABEL `points` (TRANSAKSI POIN)
                Point::create([
                    'user_id' => Auth::id(),
                'points' => $points_to_add, // Nilai poin yang diberikan (20)
                'reason' => 'Quiz completed with perfect score',
                    'quiz_id' => $this->quiz->id,
                    'course_id' => $this->quiz->course_id ?? null,
                // Anda juga bisa menambahkan course_id jika dibutuhkan
            ]);

            $status_complete = true; // Set status selesai karena skor sempurna
        }
        // SELALU BUAT record baru setiap kali kuis selesai.
        // Ini adalah "pembayaran token" Anda.
        $this->attempt = QuizAttempt::create([
            'quiz_id' => $this->quiz->id,
            'user_id' => Auth::id(),
            'score' => $this->score,
            'started_at' => now(), // Bisa disesuaikan jika Anda menyimpan waktu mulai
            'completed_at' => now(),
        ]);

        // Simpan detail jawaban ke attempt yang baru saja dibuat.
        foreach ($this->userAnswers as $answerData) {
            $this->attempt->userAnswers()->create($answerData);
---
insert into `quiz_attempts` (`quiz_id`, `user_id`, `score`, `started_at`, `completed_at`, `updated_at`, `created_at`) values (12, '9f1309be-2530-4f7e-8cea-1be8407e7056', 30, '2025-11-11 12:59:24', '2025-11-11 12:59:24', '2025-11-11 12:59:24', '2025-11-11 12:59:24')
insert into `user_answers` (`question_id`, `answer_id`, `is_correct`, `attempt_id`, `updated_at`, `created_at`) values (46, 166, 0, 985, '2025-11-11 12:59:24', '2025-11-11 12:59:24')

    public function getReviewAnswers()
    {
        if (!$this->attempt)
            return collect();
        $this->attempt->load('userAnswers.question', 'userAnswers.answer');
---
select * from `answers` where `answers`.`id` in (160, 162, 166, 171, 176, 178, 184, 187, 191, 195) and `answers`.`deleted_at` is null
select * from `questions` where `questions`.`id` in (44, 45, 46, 47, 48, 49, 50, 51, 52, 53) and `questions`.`deleted_at` is null