app/Http/Controllers/CertificateController.php

    public function download(Course $course)
    {
        // Pastikan relasi 'userEducation.department' dan 'userEducation.program' sudah didefinisikan
        // di models Users.php dan UserEducation.php
        $user = auth()->user()->load('userEducation.department', 'userEducation.program');
---
select * from `departments` where `departments`.`id` in (1) and `departments`.`deleted_at` is null
select * from `programs` where `programs`.`id` in (1) and `programs`.`deleted_at` is null
select * from `user_education` where `user_education`.`user_id` in ('9f1309be-2530-4f7e-8cea-1be8407e7056') and `user_education`.`deleted_at` is null