app/Livewire/Courses/Information.php

select * from `courses` where `courses`.`id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' and `courses`.`deleted_at` is null limit 1
---
    public function mount($courseID)
    {
        $this->courseID = $courseID;
        $this->total_materials = Course::findOrFail($courseID)->total_materials;
        $this->total_chapters = Course::findOrFail($courseID)->total_chapters;