app/Livewire/Courses/Leaderboard.php

    public function mount($courseID)
    {
        $this->courseID = $courseID;
        $currentUserId = Auth::id();

        $course = Course::find($this->courseID);
        $this->courseName = $course ? $course->course_name : 'this course';

        $this->topPoints = Point::where('course_id', $this->courseID)
            ->groupBy('user_id')
            ->selectRaw('user_id, SUM(points) as total_points')
            ->orderBy('total_points', 'desc')
            ->take(5)
            ->get();

        $this->topPoints = $this->topPoints->map(function ($point) {
            $user = User::find($point->user_id);
            $point->name = $user->name;
            $point->avatar = $user->profile_photo_url;
            $point->formatted_points = $this->formatPoints($point->total_points);

            return $point;
        });

        $allPoints = Point::where('course_id', $this->courseID)
            ->groupBy('user_id')
            ->select('user_id', DB::raw('SUM(points) as total_points'))
            ->orderBy('total_points', 'desc')
            ->get();
---
select * from `courses` where `courses`.`id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' and `courses`.`deleted_at` is null limit 1
select user_id, SUM(points) as total_points from `points` where `course_id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' group by `user_id` order by `total_points` desc limit 5
select * from `users` where `users`.`id` = '9f1215a6-8224-454d-a2e6-1fc239dfb96d' and `users`.`deleted_at` is null limit 1
select `user_id`, SUM(points) as total_points from `points` where `course_id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' group by `user_id` order by `total_points` desc