app/Livewire/Courses/LearnLayout.php

    public function mount($courseID)
    {
        $this->courseID = $courseID;
        $this->userId = Auth::id();
        $this->data = Chapter::where('course_id', $this->courseID)
            ->with(['materials' => function ($query) {
                $query->orderBy('order_number');
            }, 'materials.userMaterialStatus' => function ($query) {
                $query->where('user_id', $this->userId);
            }])
            ->orderBy('chapter_number')
            ->get();
---
select * from `chapters` where `course_id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' and `chapters`.`deleted_at` is null order by `chapter_number` asc
select * from `courses` where `courses`.`id` in ('9e7d93db-744c-4dcd-8c30-e9f79d63e21a') and `courses`.`deleted_at` is null
select * from `materials` where `materials`.`chapter_id` in ('01jpy62q17ye656md8jkgh9bak', '01jpy67bqaz9pf3xfq8d01c1v1', '01jpy6dwwrgx78amcs10w427hc', '01jpy6fcvnajgxzyngrjn1eb1g', '01jpy6gfp23773bkprhe6qhqp0', '01jpy6h7f7zsdhcsc5g0jcs4fe', '01jpy6j0zyeh9p1vwgnjvgwc3n', '01jpy6pdjxktbwvz07f77h2kzt', '01jpy6qa38qy68f88r3s6dq2hm', '01jpy6rmqtvnjx3c5xps7b28a0') and `materials`.`deleted_at` is null order by `order_number` asc
select * from `user_material_statuses` where `user_material_statuses`.`material_id` in ('01jpy655kxe10144vnx70g4ayf', '01jpy6vm84b3ve90q07k24e8r7', '01jpy6y2y44p8gw8yk5w1668x1', '01jpy71y43chbhsx8gkqpx8vmd', '01jpy73gf07ep34zvz3dedc3gf', '01jpy74kd2gktt5bxdmest134d', '01jpy75ptf1289f5mf0nzbba0y', '01jpy7aqsynj9k183n81k32gm7', '01jpy7c24m6xw46hf3eempm9yv', '01jpy7d08q9xx54egn2zj1p4mz', '01jwsrfr402w9carejjsnye7m6', '01jwst6mt61ve1gtnt55gjstnc', '01jwst9bgg8cdynwwj1ev46epr', '01jwstb3wqr2mqkmdd2zt1hce5', '01jwstce49gkpy4emzg4a0dhq4', '01jwstdm1xjtttfwp32e0jmhps', '01jwstf0xsxz54sx03zypek11t', '01jwstgbt5vmesqtjpmcfx9fm2', '01jwsthfbybqatz4mb6sbdahy8', '01jwstjnpmxm3wb81ppvkgt1em') and `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056'