app/Livewire/Courses/MaterialInfo.php

select * from `quiz_attempts` where `quiz_id` = 17 and `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056' order by `created_at` desc
---

                // Lanjutkan memuat data attempt jika lolos pengecekan (Kode Anda sudah benar)
                $currentUserId = auth()->id();
                $this->quizAttempts = QuizAttempt::where('quiz_id', $quizId)
                    ->where('user_id', $currentUserId)
                    ->orderBy('created_at', 'desc')
                    ->get();

select * from `materials` where `materials`.`id` = '01jwstgbt5vmesqtjpmcfx9fm2' and `materials`.`deleted_at` is null limit 1
---

            } elseif ($materialId) {
                $this->materialId = $materialId;
                $this->material = Material::findOrFail($materialId);

select * from `user_material_statuses` where `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056' and `material_id` = '01jwstgbt5vmesqtjpmcfx9fm2' limit 1
---

                // Lanjutkan memuat status materi dan timer (Kode Anda sudah benar)
                $userId = Auth::id();
                $userMaterialStatus = UserMaterialStatus::where('user_id', $userId)
                    ->where('material_id', $this->material->id)
                    ->first();

insert into `user_material_statuses` (`user_id`, `material_id`, `is_completed`, `completed_at`, `updated_at`, `created_at`) values ('9f1309be-2530-4f7e-8cea-1be8407e7056', '01jwstgbt5vmesqtjpmcfx9fm2', 0, '2025-11-11 13:45:01', '2025-11-11 13:43:01', '2025-11-11 13:43:01')
---
                        }
                    }
                } else {
                     UserMaterialStatus::create([ 'user_id' => $userId, 'material_id' => $this->material->id, 'is_completed' => 0, 'completed_at' => now()->addSeconds($materialDurationSeconds) ]);

select * from `chapters` where `chapters`.`id` = '01jpy6qa38qy68f88r3s6dq2hm' and `chapters`.`deleted_at` is null limit 1
select * from `chapters` where `course_id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' and `chapter_number` < 9 and `chapters`.`deleted_at` is null order by `chapter_number` desc limit 1
select exists(select * from `quiz_attempts` where `quiz_id` = 16 and `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056' and `score` = 100) as `exists`
---
    private function checkPreviousQuizScore($chapterId)
    {
        $userId = Auth::id();
        $currentChapter = Chapter::find($chapterId);

        if (!$currentChapter || $currentChapter->chapter_number <= 1) {
            return true;
        }

        // Cari chapter sebelumnya DI DALAM COURSE YANG SAMA berdasarkan nomor chapter.
        $previousChapter = Chapter::where('course_id', $currentChapter->course_id)
            ->where('chapter_number', '<', $currentChapter->chapter_number)
            ->orderBy('chapter_number', 'desc')
            ->first();

        if (!$previousChapter) return true;
        $previousQuiz = Quiz::where('chapter_id', $previousChapter->id)->first();
        if (!$previousQuiz) return true;

        return QuizAttempt::where('quiz_id', $previousQuiz->id)
            ->where('user_id', $userId)
            ->where('score', 100)
            ->exists();

select * from `materials` where `chapter_id` = '01jpy6qa38qy68f88r3s6dq2hm' and `order_number` > 2 and `materials`.`deleted_at` is null order by `order_number` asc limit 1
---
    public function nextMaterial()
    {
        if (!$this->material) {
            $this->message = 'Tidak ada materi yang sedang ditampilkan.';
            return;
        }

        $currentChapter = $this->material->chapter;
        $nextItem = null; // Variabel untuk menampung item berikutnya

        // Cari materi berikutnya di chapter yang sama
        $nextMaterial = Material::where('chapter_id', $currentChapter->id)
            ->where('order_number', '>', $this->material->order_number)
            ->orderBy('order_number', 'asc')
            ->first();

select * from `user_material_statuses` where `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056' and `material_id` = '01jwsthfbybqatz4mb6sbdahy8' limit 1
update `user_material_statuses` set `is_completed` = 1, `completed_at` = '2025-11-11 13:59:24', `user_material_statuses`.`updated_at` = '2025-11-11 13:59:24' where `id` = 1459
---
    public function markMaterialAsCompleted()
    {
        $userId = Auth::id();
        if ($this->materialId && $userId) {
            $userMaterialStatus = UserMaterialStatus::where('user_id', $userId)
                                                    ->where('material_id', $this->materialId)
                                                    ->first();
            if ($userMaterialStatus) {
                $userMaterialStatus->is_completed = 1;
                $userMaterialStatus->completed_at = now();
                $userMaterialStatus->save();