app/Livewire/Courses/Point.php

select sum(`points`) as aggregate from `points` where `course_id` = '9e7d93db-744c-4dcd-8c30-e9f79d63e21a' and `user_id` = '9f1309be-2530-4f7e-8cea-1be8407e7056'
---
    public function mount($courseID)
    {
        $this->user = Auth::id();
        $this->courseID = $courseID;
        $this->topPoints = $this->formatPoints(
            Points::where('course_id', $this->courseID)
                ->where('user_id', $this->user)
                ->sum('points')
        );