app/Models/Course.php

    public function getTotalMaterialsCompletedByUser($userId)
    {
        return $this->chapters->sum(function ($chapter) use ($userId) {
            return $chapter->materials->sum(function ($material) use ($userId) {
                return $material->userMaterialStatus()
                    ->where('user_id', $userId)
                    ->where('is_completed', true)
                    ->count();
---
select count(*) as aggregate from `user_material_statuses` where `user_material_statuses`.`material_id` = '01jq0f9nd9zax2k2cwf6j5j8v5' and `user_material_statuses`.`material_id` is not null and `user_id` = '9dfbcc50-7251-4350-890d-eaa04853818b' and `is_completed` = 1

    public function getLastCompletedMaterialByUser($userId)
    {
        $lastCompletedStatus = UserMaterialStatus::whereHas('material.chapter', function ($query) {
            $query->where('course_id', $this->id);
        })
            ->where('user_id', $userId)
            ->where('is_completed', true)
            ->orderBy('completed_at', 'desc')
            ->first();
---
select * from `user_material_statuses` where exists (select * from `materials` where `user_material_statuses`.`material_id` = `materials`.`id` and exists (select * from `chapters` where `materials`.`chapter_id` = `chapters`.`id` and `course_id` = '9e7da199-29a5-4edf-825b-5b54f7bca185' and `chapters`.`deleted_at` is null) and `materials`.`deleted_at` is null) and `user_id` = '9dfbcc50-7251-4350-890d-eaa04853818b' and `is_completed` = 1 order by `completed_at` desc limit 1